# SQL Practice Problems using sqlite + Pandas + Jupyter notebooks and Northwinds Database 

###### DB: https://docs.microsoft.com/en-us/dotnet/framework/data/adonet/sql/linq/downloading-sample-databases

In [1]:
import sqlite3

# Create a SQL connection to our SQLite database
con = sqlite3.connect("Northwind_large.sqlite")

# check available tables 
import pandas as pd

cur = con.cursor()
cur.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;")
available_table=(cur.fetchall())

In [25]:
# Problem 32: High value customers: at least 1 order > 10000 in 2015

Q = '''Select
Customers.Id,
Customers.CompanyName,Orders.ID, 
sum(Quantity * UnitPrice) as TAM
From Customer Customers 
    Join "Order" Orders on Orders.CustomerID = Customers.ID 
    Join OrderDetail OrderDetails on Orders.ID= OrderDetails.OrderId 
    Where 
        OrderDate >= "20150101" and OrderDate < "20160101"
        
        Group By 
            Customers.ID,
            Customers.CompanyName,
            Orders.ID
            having TAM > 10000'''

pd.read_sql( Q , con)

        Id          CompanyName     Id       TAM
0    ALFKI  Alfreds Futterkiste  11565  37342.47
1    ALFKI  Alfreds Futterkiste  14496  41685.87
2    ALFKI  Alfreds Futterkiste  14606  21295.56
3    ALFKI  Alfreds Futterkiste  17114  37997.07
4    ALFKI  Alfreds Futterkiste  17765  26304.25
..     ...                  ...    ...       ...
460  WOLZA       Wolski  Zajazd  11670  35814.41
461  WOLZA       Wolski  Zajazd  14449  34936.00
462  WOLZA       Wolski  Zajazd  15391  42307.49
463  WOLZA       Wolski  Zajazd  21074  36276.00
464  WOLZA       Wolski  Zajazd  24809  10734.50

[465 rows x 4 columns]

In [11]:
# Problem 33 Customers Ordering total > $15000 or more in 2015


Q = '''Select
Customers.Id,
Customers.CompanyName,
sum(Quantity *UnitPrice* (1-Discount)) as Amt_With_Discount
From Customer Customers 
    Join "Order" Orders on Orders.CustomerID = Customers.ID 
    Join OrderDetail OrderDetails on Orders.ID= OrderDetails.OrderId 
    Where 
        OrderDate >= "20150101" and OrderDate < "20160101"
        
        Group By 
            Customers.ID,
            Customers.CompanyName
            having Amt_With_Discount > 15000 order by 3'''

pd.read_sql( Q , con)

       Id                 CompanyName  Amt_With_Discount
0   HUNGC  Hungry Coyote Import Store           28482.80
1   FOLIG           Folies gourmandes           46075.57
2   OLDWO      Old World Delicatessen           52038.56
3   SAVEA          Save-a-lot Markets           53756.33
4   RICSU          Richter Supermarkt           57696.80
..    ...                         ...                ...
86  ANTON     Antonio Moreno Taquería          300125.75
87  KOENE             Königlich Essen          318929.59
88  SUPRD            Suprêmes délices          375843.90
89  GOURL         Gourmet Lanchonetes          422673.23
90  CHOPS           Chop-suey Chinese          494779.82

[91 rows x 3 columns]

In [19]:
# Problem 34 Orders placed Only on last day of month - we break the problem into two parts
# get last day of month, and show orders where date = last date of month

Q = "SELECT EmployeeId,Id, OrderDate from 'Order' where OrderDate = date(OrderDate,'start of month','+1 month','-1 day') ;"
pd.read_sql( Q , con)

    EmployeeId     Id   OrderDate
0            5  10269  2012-07-31
1            6  10317  2012-09-30
2            4  10343  2012-10-31
3            8  10399  2012-12-31
4            3  10432  2013-01-31
5            8  10460  2013-02-28
6            1  10461  2013-02-28
7            7  10490  2013-03-31
8            8  10491  2013-03-31
9            4  10522  2013-04-30
10           2  10583  2013-06-30
11           4  10584  2013-06-30
12           1  10616  2013-07-31
13           4  10617  2013-07-31
14           2  10686  2013-09-30
15           9  10687  2013-09-30
16           4  10725  2013-10-31
17           3  10806  2013-12-31
18           4  10807  2013-12-31
19           8  10987  2014-03-31
20           3  10988  2014-03-31
21           2  10989  2014-03-31
22           2  11060  2014-04-30
23           4  11061  2014-04-30
24           4  11062  2014-04-30
25           3  11063  2014-04-30

In [20]:
# Problem 35 for each employee, Orders placed Only on last day of month - we break the problem into two parts
# get last day of month, and show orders where date = last date of month

Q = "SELECT EmployeeId, count(*) from 'Order' where OrderDate = date(OrderDate,'start of month','+1 month','-1 day') group by 1;"
pd.read_sql( Q , con)

   EmployeeId  count(*)
0           1         2
1           2         4
2           3         4
3           4         8
4           5         1
5           6         1
6           7         1
7           8         4
8           9         1